// Licensed to the Apache Software Foundation (ASF) under one
// or more contributor license agreements.  See the NOTICE file
// distributed with this work for additional information
// regarding copyright ownership.  The ASF licenses this file
// to you under the Apache License, Version 2.0 (the
// "License"); you may not use this file except in compliance
// with the License.  You may obtain a copy of the License at
//
//   http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing,
// software distributed under the License is distributed on an
// "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
// KIND, either express or implied.  See the License for the
// specific language governing permissions and limitations
// under the License.


#ifndef IMPALA_EXEC_PARQUET_COMMON_H
#define IMPALA_EXEC_PARQUET_COMMON_H

#include <boost/preprocessor/repetition/repeat_from_to.hpp>
#include <sstream>

#include "common/compiler-util.h"
#include "gen-cpp/Descriptors_types.h"
#include "gen-cpp/parquet_types.h"
#include "runtime/date-value.h"
#include "runtime/decimal-value.h"
#include "runtime/string-value.h"
#include "runtime/timestamp-value.inline.h"
#include "util/bit-util.h"
#include "util/decimal-util.h"
#include "util/mem-util.h"

/// This file contains common elements between the parquet Writer and Scanner.
namespace impala {

const uint8_t PARQUET_VERSION_NUMBER[4] = {'P', 'A', 'R', '1'};
const uint32_t PARQUET_MAX_SUPPORTED_VERSION = 2;
const uint32_t PARQUET_WRITER_VERSION = 1;

/// Struct that specifies an inclusive range of rows.
struct RowRange {
  int64_t first;
  int64_t last;
};

inline bool operator==(const RowRange& lhs, const RowRange& rhs) {
  return lhs.first == rhs.first && lhs.last == rhs.last;
}

inline bool operator<(const RowRange& lhs, const RowRange& rhs) {
  return std::tie(lhs.first, lhs.last) < std::tie(rhs.first, rhs.last);
}

// Return true if this is an encoding enum value that indicates that a data page is
// dictionary encoded.
inline bool IsDictionaryEncoding(parquet::Encoding::type encoding) {
  return encoding == parquet::Encoding::PLAIN_DICTIONARY
      || encoding == parquet::Encoding::RLE_DICTIONARY;
}

/// Return the Impala compression type for the given Parquet codec. The caller must
/// validate that the codec is a supported one, otherwise this will DCHECK.
THdfsCompression::type ConvertParquetToImpalaCodec(parquet::CompressionCodec::type codec);

/// Return the Parquet code for the given Impala compression type. The caller must
/// validate that the codec is a supported one, otherwise this will DCHECK.
parquet::CompressionCodec::type ConvertImpalaToParquetCodec(
    THdfsCompression::type codec);

/// Returns the row range for the given page idx using information from the row group and
/// offset index.
void GetRowRangeForPage(const parquet::RowGroup& row_group,
    const parquet::OffsetIndex& offset_index, int page_idx, RowRange* row_range);

/// Struct that specifies an inclusive range of pages.
struct PageRange {
  int64_t first;
  int64_t last;

  PageRange(int64_t u, int64_t v) : first(u), last(v) {}
  bool overlap(const PageRange& other) const {
    return !(last < other.first || other.last < first);
  }
  bool operator==(const PageRange& other) const {
    return (first == other.first && last == other.last);
  }

  std::string toString() const {
    std::stringstream ss;
    ss << "[" << first << ", " << last << "]";
    return ss.str();
  }

  // Populate the bit vector 'pageIndices' by setting bits corresponding to the pages
  // in range [first, last] to on.
  void convertToIndices(std::vector<bool>* pageIndices) const {
    DCHECK(pageIndices);
    for (int i = first; i <= last; i++) {
      (*pageIndices)[i] = true;
    }
  }
};

inline bool IsValidPageLocation(const parquet::PageLocation& page_loc,
    const int64_t num_rows) {
  return page_loc.offset >= 0 &&
         page_loc.first_row_index >= 0 &&
         page_loc.first_row_index < num_rows;
}

/// Returns the row range for a given page range using information from the row group
/// and offset index.
void GetRowRangeForPageRange(const parquet::RowGroup& row_group,
    const parquet::OffsetIndex& offset_index, const PageRange& page_range,
    RowRange* row_range);

/// Given a column chunk containing rows in the range [0, 'num_rows'), 'skip_ranges'
/// contains the row ranges we are not interested in. 'skip_ranges' can be redundant and
/// can potentially contain ranges that intersect with each other. As a side-effect, this
/// function sorts 'skip_ranges'.
/// 'candidate_ranges' will contain the set of row ranges that we want to scan.
/// Returns false if the input data is invalid.
bool ComputeCandidateRanges(const int64_t num_rows, std::vector<RowRange>* skip_ranges,
    std::vector<RowRange>* candidate_ranges);

/// This function computes the pages that intersect with 'candidate_ranges'. I.e. it
/// determines the pages that we actually need to read from a given column chunk.
/// 'candidate_pages' will hold the indexes of such pages.
/// Returns true on success, false otherwise.
bool ComputeCandidatePages(
    const std::vector<parquet::PageLocation>& page_locations,
    const std::vector<RowRange>& candidate_ranges,
    const int64_t num_rows, std::vector<int>* candidate_pages);

/// The plain encoding does not maintain any state so all these functions
/// are static helpers.
/// TODO: we are using templates to provide a generic interface (over the
/// types) to avoid performance penalties. This makes the code more complex
/// and should be removed when we have codegen support to inline virtual
/// calls.
class ParquetPlainEncoder {
 public:
  /// Returns the byte size of 'v' where InternalType is the datatype that Impala uses
  /// internally to store tuple data. Used in some template function implementations to
  /// determine the encoded byte size for fixed-length types.
  template <typename InternalType>
  static int ByteSize(const InternalType& v) { return sizeof(InternalType); }

  /// Returns the encoded size of values of type t. Returns -1 if it is variable
  /// length. This can be different than the slot size of the types.
  static int EncodedByteSize(const ColumnType& t) {
    switch (t.type) {
      case TYPE_STRING:
      case TYPE_VARCHAR:
      case TYPE_CHAR:
        // CHAR is varlen here because we don't write the padding to the file
        return -1;
      case TYPE_TINYINT:
      case TYPE_SMALLINT:
      case TYPE_INT:
      case TYPE_DATE:
      case TYPE_FLOAT:
        return 4;
      case TYPE_BIGINT:
      case TYPE_DOUBLE:
        return 8;
      case TYPE_TIMESTAMP:
        return 12;
      case TYPE_DECIMAL:
        return DecimalSize(t);
      case TYPE_NULL:
      case TYPE_BOOLEAN: // These types are not plain encoded.
      default:
        DCHECK(false);
        return -1;
    }
  }

  /// Returns the byte size of a value of Parqet type `type`. If `type` is
  /// FIXED_LEN_BYTE_ARRAY, the argument `fixed_len_size` is returned.
  /// The type must be one of INT32, INT64, INT96, FLOAT, DOUBLE or FIXED_LEN_BYTE_ARRAY.
  /// BOOLEANs are not plain encoded and BYTE_ARRAYs do not have a fixed size, therefore
  /// they are not supported.
  static ALWAYS_INLINE int EncodedByteSize(const parquet::Type::type type,
      const int fixed_len_size) {
    switch (type) {
      case parquet::Type::type::INT32: return sizeof(int32_t);
      case parquet::Type::type::INT64: return sizeof(int64_t);
      case parquet::Type::type::INT96: return 12;
      case parquet::Type::type::FLOAT: return sizeof(float);
      case parquet::Type::type::DOUBLE: return sizeof(double);
      case parquet::Type::type::FIXED_LEN_BYTE_ARRAY: return fixed_len_size;
      default: DCHECK(false);
    };

    return -1;
  }

  /// The minimum byte size to store decimals of with precision t.precision.
  static int DecimalSize(const ColumnType& t) {
    DCHECK(t.type == TYPE_DECIMAL);
    // Numbers in the comment is the max positive value that can be represented
    // with those number of bits (max negative is -(X + 1)).
    // TODO: use closed form for this?
    switch (t.precision) {
      case 1: case 2:
        return 1; // 127
      case 3: case 4:
        return 2; // 32,767
      case 5: case 6:
        return 3; // 8,388,607
      case 7: case 8: case 9:
        return 4; // 2,147,483,427
      case 10: case 11:
        return 5; // 549,755,813,887
      case 12: case 13: case 14:
        return 6; // 140,737,488,355,327
      case 15: case 16:
        return 7; // 36,028,797,018,963,967
      case 17: case 18:
        return 8; // 9,223,372,036,854,775,807
      case 19: case 20: case 21:
        return 9; // 2,361,183,241,434,822,606,847
      case 22: case 23:
        return 10; // 604,462,909,807,314,587,353,087
      case 24: case 25: case 26:
        return 11; // 154,742,504,910,672,534,362,390,527
      case 27: case 28:
        return 12; // 39,614,081,257,132,168,796,771,975,167
      case 29: case 30: case 31:
        return 13; // 10,141,204,801,825,835,211,973,625,643,007
      case 32: case 33:
        return 14; // 2,596,148,429,267,413,814,265,248,164,610,047
      case 34: case 35:
        return 15; // 664,613,997,892,457,936,451,903,530,140,172,287
      case 36: case 37: case 38:
        return 16; // 170,141,183,460,469,231,731,687,303,715,884,105,727
      default:
        DCHECK(false);
        break;
    }
    return -1;
  }

  /// Encodes t into buffer. Returns the number of bytes added.  buffer must
  /// be preallocated and big enough.  Buffer need not be aligned.
  /// 'fixed_len_size' is only applicable for data encoded using FIXED_LEN_BYTE_ARRAY and
  /// is the number of bytes the plain encoder should use.
  template <typename InternalType>
  static int Encode(const InternalType& t, int fixed_len_size, uint8_t* buffer) {
    memcpy(buffer, &t, ByteSize(t));
    return ByteSize(t);
  }

  template <typename InternalType>
  static int DecodeByParquetType(const uint8_t* buffer, const uint8_t* buffer_end,
      int fixed_len_size, InternalType* v, parquet::Type::type parquet_type) {
    switch (parquet_type) {
      case parquet::Type::BOOLEAN:
        return ParquetPlainEncoder::Decode<InternalType, parquet::Type::BOOLEAN>(buffer,
